---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportTooFarAway
source: html/f118c891-0c30-a2e1-c66e-d6681acf7205.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportTooFarAway Property

Imported objects located a large distance from the model might not display properly. The 'Center-to-Center' option will be used.

## Syntax (C#)
```csharp
public static FailureDefinitionId ImportTooFarAway { get; }
```